### Deploy Env ☁️ `dev`

#### Terraform Format and Style 🖌`✅`
#### Terraform Initialization ⚙️`✅`
#### Terraform Validation 🤖`✅`

<details><summary>Validation Output</summary>

  ```
  Success! The configuration is valid.


  ```

</details>

#### Terraform Plan 📖`✅`

<details><summary>Show Plan</summary>

  ```terraform
  module.ecs.data.aws_iam_policy.ecs_managed_role_policy: Reading...
module.ecs.data.aws_iam_policy_document.assume_role: Reading...
module.s3_bucket_dev.aws_s3_bucket_public_access_block.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.aws_vpc.tag_gen_vpc: Refreshing state... [id=vpc-0afb003a4285e005b]
module.ecs.aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:cluster/taggenerator-cluster-dev]
module.ecs.data.aws_iam_policy_document.inline_policy_doc: Reading...
module.ecs.aws_eip.elasticips["pub1"]: Refreshing state... [id=eipalloc-0553d46b53831291f]
module.s3_bucket_dev.aws_s3_bucket.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.aws_eip.elasticips["pub2"]: Refreshing state... [id=eipalloc-0e9ffd853090376d0]
module.ecs.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1077804475]
module.ecs.data.aws_iam_policy_document.inline_policy_doc: Read complete after 0s [id=3977984228]
module.ecs.aws_iam_policy.inline_policy: Refreshing state... [id=arn:aws:iam::637423196893:policy/ECSTaskS3RoleInlinePolicy]
module.ecs.aws_iam_role.this: Refreshing state... [id=ECSTaskExecutionRole]
module.ecs.aws_iam_role.api_task: Refreshing state... [id=TaggeneratorApiECSTaskRole]
module.ecs.data.aws_iam_policy.ecs_managed_role_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.ecs.aws_iam_role_policy_attachment.that: Refreshing state... [id=TaggeneratorApiECSTaskRole-20240821120021803400000002]
module.ecs.aws_iam_role_policy_attachment.this: Refreshing state... [id=ECSTaskExecutionRole-20240821120021895800000003]
module.ecs.aws_ecs_task_definition.ui_task: Refreshing state... [id=taggenerator-ui-task-dev]
module.ecs.aws_ecs_task_definition.api_task: Refreshing state... [id=taggenerator-api-task-dev]
module.ecs.aws_internet_gateway.ig: Refreshing state... [id=igw-09b9629e7e7976ca0]
module.ecs.aws_subnet.publics["pub1"]: Refreshing state... [id=subnet-06d44da41a8748012]
module.ecs.aws_subnet.publics["pub2"]: Refreshing state... [id=subnet-0ba16a5d6beb2a8fd]
module.ecs.aws_security_group.lb_security_group: Refreshing state... [id=sg-0383b0b45913929da]
module.ecs.aws_service_discovery_private_dns_namespace.this: Refreshing state... [id=ns-kqie7d2lb4wjsspn]
module.ecs.aws_subnet.privates["priv1"]: Refreshing state... [id=subnet-0dfc24834b84490fd]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/96721125ca38cd81]
module.ecs.aws_subnet.privates["priv2"]: Refreshing state... [id=subnet-0ee30475d55bab8b3]
module.s3_bucket_dev.aws_s3_bucket_ownership_controls.example: Refreshing state... [id=tek-tag-generator-dev]
module.ecs.aws_security_group.ecs_ui_sg: Refreshing state... [id=sg-0f72db9266d6c204e]
module.s3_bucket_dev.aws_s3_bucket_acl.example: Refreshing state... [id=tek-tag-generator-dev,private]
module.ecs.aws_nat_gateway.nats["pub1"]: Refreshing state... [id=nat-039896f75a586da5f]
module.ecs.aws_nat_gateway.nats["pub2"]: Refreshing state... [id=nat-0e369b626907b2304]
module.ecs.aws_lb.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:loadbalancer/app/load-balancer-dev/ada8db57b66e78be]
module.ecs.aws_route_table.public: Refreshing state... [id=rtb-0573a369ddbbedf8e]
module.ecs.aws_security_group.ecs_api_sg: Refreshing state... [id=sg-09663daef83b887f1]
module.ecs.aws_route_table.privates["priv2"]: Refreshing state... [id=rtb-034bb1a09c167df58]
module.ecs.aws_route_table.privates["priv1"]: Refreshing state... [id=rtb-070de0b921f1c2b03]
module.ecs.aws_ecs_service.api: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:service/taggenerator-cluster-dev/taggenerator-api-service-dev]
module.ecs.aws_ecs_service.ui: Refreshing state... [id=arn:aws:ecs:eu-west-3:637423196893:service/taggenerator-cluster-dev/taggenerator-ui-service-dev]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:637423196893:listener/app/load-balancer-dev/ada8db57b66e78be/d474a03facf12256]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.api will be updated in-place
  ~ resource "aws_ecs_service" "api" {
        id                                 = "arn:aws:ecs:eu-west-3:637423196893:service/taggenerator-cluster-dev/taggenerator-api-service-dev"
        name                               = "taggenerator-api-service-dev"
        tags                               = {}
        # (16 unchanged attributes hidden)

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-09663daef83b887f1",
            ] -> (known after apply)
          ~ subnets          = [
              - "subnet-0dfc24834b84490fd",
              - "subnet-0ee30475d55bab8b3",
            ] -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ service_connect_configuration {
          ~ namespace = "arn:aws:servicediscovery:eu-west-3:637423196893:namespace/ns-kqie7d2lb4wjsspn" -> (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.ui will be updated in-place
  ~ resource "aws_ecs_service" "ui" {
        id                                 = "arn:aws:ecs:eu-west-3:637423196893:service/taggenerator-cluster-dev/taggenerator-ui-service-dev"
        name                               = "taggenerator-ui-service-dev"
        tags                               = {}
        # (16 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "taggenerator-ui-container" -> null
          - container_port   = 8501 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/96721125ca38cd81" -> null
        }
      + load_balancer {
          + container_name   = "taggenerator-ui-container"
          + container_port   = 8501
          + target_group_arn = (known after apply)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-0f72db9266d6c204e",
            ] -> (known after apply)
          ~ subnets          = [
              - "subnet-0dfc24834b84490fd",
              - "subnet-0ee30475d55bab8b3",
            ] -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ service_connect_configuration {
          ~ namespace = "arn:aws:servicediscovery:eu-west-3:637423196893:namespace/ns-kqie7d2lb4wjsspn" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_internet_gateway.ig will be updated in-place
  ~ resource "aws_internet_gateway" "ig" {
        id       = "igw-09b9629e7e7976ca0"
        tags     = {
            "Name" = "TagGen IG"
        }
      ~ vpc_id   = "vpc-0afb003a4285e005b" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.ecs.aws_lb.lb will be updated in-place
  ~ resource "aws_lb" "lb" {
        id                                          = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:loadbalancer/app/load-balancer-dev/ada8db57b66e78be"
        name                                        = "load-balancer-dev"
      ~ security_groups                             = [
          - "sg-0383b0b45913929da",
        ] -> (known after apply)
      ~ subnets                                     = [
          - "subnet-06d44da41a8748012",
          - "subnet-0ba16a5d6beb2a8fd",
        ] -> (known after apply)
        tags                                        = {}
        # (20 unchanged attributes hidden)

      - subnet_mapping {
          - subnet_id = "subnet-06d44da41a8748012" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0ba16a5d6beb2a8fd" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_lb_listener.listener will be updated in-place
  ~ resource "aws_lb_listener" "listener" {
        id                = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:listener/app/load-balancer-dev/ada8db57b66e78be/d474a03facf12256"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/96721125ca38cd81" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.ecs.aws_lb_target_group.target_group must be replaced
-/+ resource "aws_lb_target_group" "target_group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/96721125ca38cd81" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/UI-target-group-dev/96721125ca38cd81" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-3:637423196893:targetgroup/UI-target-group-dev/96721125ca38cd81" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "UI-target-group-dev"
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ vpc_id                             = "vpc-0afb003a4285e005b" # forces replacement -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_health_state {}
    }

  # module.ecs.aws_nat_gateway.nats["pub1"] must be replaced
-/+ resource "aws_nat_gateway" "nats" {
      ~ association_id                     = "eipassoc-0ac3a08030fd39668" -> (known after apply)
      ~ id                                 = "nat-039896f75a586da5f" -> (known after apply)
      ~ network_interface_id               = "eni-03d7beeddec52d16e" -> (known after apply)
      ~ private_ip                         = "10.0.0.74" -> (known after apply)
      ~ public_ip                          = "15.236.78.52" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-06d44da41a8748012" # forces replacement -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "NatGateway for Public Subnet 1"
        }
        # (3 unchanged attributes hidden)
    }

  # module.ecs.aws_nat_gateway.nats["pub2"] must be replaced
-/+ resource "aws_nat_gateway" "nats" {
      ~ association_id                     = "eipassoc-013d5778208940da9" -> (known after apply)
      ~ id                                 = "nat-0e369b626907b2304" -> (known after apply)
      ~ network_interface_id               = "eni-03baac8f1f324a020" -> (known after apply)
      ~ private_ip                         = "10.0.1.78" -> (known after apply)
      ~ public_ip                          = "13.39.41.81" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0ba16a5d6beb2a8fd" # forces replacement -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "NatGateway for Public Subnet 2"
        }
        # (3 unchanged attributes hidden)
    }

  # module.ecs.aws_route_table.privates["priv1"] is tainted, so must be replaced
-/+ resource "aws_route_table" "privates" {
      ~ arn              = "arn:aws:ec2:eu-west-3:637423196893:route-table/rtb-070de0b921f1c2b03" -> (known after apply)
      ~ id               = "rtb-070de0b921f1c2b03" -> (known after apply)
      ~ owner_id         = "637423196893" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-039896f75a586da5f"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.0.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "local"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/20"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "local"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "Private Route Table priv1"
        }
      ~ vpc_id           = "vpc-0afb003a4285e005b" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_route_table.privates["priv2"] is tainted, so must be replaced
-/+ resource "aws_route_table" "privates" {
      ~ arn              = "arn:aws:ec2:eu-west-3:637423196893:route-table/rtb-034bb1a09c167df58" -> (known after apply)
      ~ id               = "rtb-034bb1a09c167df58" -> (known after apply)
      ~ owner_id         = "637423196893" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0e369b626907b2304"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.0.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "local"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/20"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "local"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "Private Route Table priv2"
        }
      ~ vpc_id           = "vpc-0afb003a4285e005b" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_route_table.public is tainted, so must be replaced
-/+ resource "aws_route_table" "public" {
      ~ arn              = "arn:aws:ec2:eu-west-3:637423196893:route-table/rtb-0573a369ddbbedf8e" -> (known after apply)
      ~ id               = "rtb-0573a369ddbbedf8e" -> (known after apply)
      ~ owner_id         = "637423196893" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.0.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "local"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.0.0.0/20"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "local"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
            # (1 unchanged element hidden)
        ]
        tags             = {
            "Name" = "Public Route"
        }
      ~ vpc_id           = "vpc-0afb003a4285e005b" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_route_table_association.privates["priv1"] will be created
  + resource "aws_route_table_association" "privates" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ecs.aws_route_table_association.privates["priv2"] will be created
  + resource "aws_route_table_association" "privates" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ecs.aws_route_table_association.publics["pub1"] will be created
  + resource "aws_route_table_association" "publics" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ecs.aws_route_table_association.publics["pub2"] will be created
  + resource "aws_route_table_association" "publics" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ecs.aws_security_group.ecs_api_sg must be replaced
-/+ resource "aws_security_group" "ecs_api_sg" {
      ~ arn                    = "arn:aws:ec2:eu-west-3:637423196893:security-group/sg-09663daef83b887f1" -> (known after apply)
      ~ id                     = "sg-09663daef83b887f1" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "rule for inbound API call"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0f72db9266d6c204e",
                ]
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "rule for inbound API call"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
        name                   = "ecs-api"
      + name_prefix            = (known after apply)
      ~ owner_id               = "637423196893" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-0afb003a4285e005b" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.ecs_ui_sg must be replaced
-/+ resource "aws_security_group" "ecs_ui_sg" {
      ~ arn                    = "arn:aws:ec2:eu-west-3:637423196893:security-group/sg-0f72db9266d6c204e" -> (known after apply)
      ~ id                     = "sg-0f72db9266d6c204e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "rule for inbound UI call"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0383b0b45913929da",
                ]
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "rule for inbound UI call"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "ecs-ui"
      + name_prefix            = (known after apply)
      ~ owner_id               = "637423196893" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-0afb003a4285e005b" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.lb_security_group must be replaced
-/+ resource "aws_security_group" "lb_security_group" {
      ~ arn                    = "arn:aws:ec2:eu-west-3:637423196893:security-group/sg-0383b0b45913929da" -> (known after apply)
      ~ id                     = "sg-0383b0b45913929da" -> (known after apply)
        name                   = "lb-sg-dev"
      + name_prefix            = (known after apply)
      ~ owner_id               = "637423196893" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-0afb003a4285e005b" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_service_discovery_private_dns_namespace.this must be replaced
-/+ resource "aws_service_discovery_private_dns_namespace" "this" {
      ~ arn         = "arn:aws:servicediscovery:eu-west-3:637423196893:namespace/ns-kqie7d2lb4wjsspn" -> (known after apply)
      ~ hosted_zone = "Z0946400ZPVI41Y0Y0YL" -> (known after apply)
      ~ id          = "ns-kqie7d2lb4wjsspn" -> (known after apply)
        name        = "taggenerator.dev"
      - tags        = {} -> null
      ~ vpc         = "vpc-0afb003a4285e005b" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_subnet.privates["priv1"] must be replaced
-/+ resource "aws_subnet" "privates" {
      ~ arn                                            = "arn:aws:ec2:eu-west-3:637423196893:subnet/subnet-0dfc24834b84490fd" -> (known after apply)
      ~ availability_zone_id                           = "euw3-az1" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0dfc24834b84490fd" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "637423196893" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet 1"
        }
      ~ vpc_id                                         = "vpc-0afb003a4285e005b" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.ecs.aws_subnet.privates["priv2"] must be replaced
-/+ resource "aws_subnet" "privates" {
      ~ arn                                            = "arn:aws:ec2:eu-west-3:637423196893:subnet/subnet-0ee30475d55bab8b3" -> (known after apply)
      ~ availability_zone_id                           = "euw3-az2" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0ee30475d55bab8b3" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "637423196893" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet 2"
        }
      ~ vpc_id                                         = "vpc-0afb003a4285e005b" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.ecs.aws_subnet.publics["pub1"] must be replaced
-/+ resource "aws_subnet" "publics" {
      ~ arn                                            = "arn:aws:ec2:eu-west-3:637423196893:subnet/subnet-06d44da41a8748012" -> (known after apply)
      ~ availability_zone_id                           = "euw3-az1" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-06d44da41a8748012" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "637423196893" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet 1"
        }
      ~ vpc_id                                         = "vpc-0afb003a4285e005b" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.ecs.aws_subnet.publics["pub2"] must be replaced
-/+ resource "aws_subnet" "publics" {
      ~ arn                                            = "arn:aws:ec2:eu-west-3:637423196893:subnet/subnet-0ba16a5d6beb2a8fd" -> (known after apply)
      ~ availability_zone_id                           = "euw3-az2" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0ba16a5d6beb2a8fd" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "637423196893" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet 2"
        }
      ~ vpc_id                                         = "vpc-0afb003a4285e005b" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.ecs.aws_vpc.tag_gen_vpc must be replaced
-/+ resource "aws_vpc" "tag_gen_vpc" {
      ~ arn                                  = "arn:aws:ec2:eu-west-3:637423196893:vpc/vpc-0afb003a4285e005b" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.0.0.0/16" -> "10.0.0.0/20" # forces replacement
      ~ default_network_acl_id               = "acl-0e8f6b4df28e1fc04" -> (known after apply)
      ~ default_route_table_id               = "rtb-08a75f97a80ea884a" -> (known after apply)
      ~ default_security_group_id            = "sg-08282656aa7e5a931" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-092a153bc04514006" -> (known after apply)
      ~ enable_dns_hostnames                 = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-0afb003a4285e005b" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-08a75f97a80ea884a" -> (known after apply)
      ~ owner_id                             = "637423196893" -> (known after apply)
      - tags                                 = {} -> null
        # (3 unchanged attributes hidden)
    }

Plan: 19 to add, 5 to change, 15 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

</details>

*Pushed by: @tekeinhor, Action: `pull_request`*